Enums/ПлатежныеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ПлатежныеСистемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SWiP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Открытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_СКБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Webmoney</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_PayMaster</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Промсвязьбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_1ССБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ЮгИнвестбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ЮМани</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Совкомбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БАНКУРАЛСИБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Экспобанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_АбсолютБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкЛевобережный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БланкБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_КБХлынов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ВЛАДБИЗНЕСБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_НОКССБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ЗемскийБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_НСБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Форштадт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_СКБПримсоцбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_КБРостФинанс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ЭсБиАйБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_АКИБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_АлефБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_НИКОБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_КБАГРОПРОМКРЕДИТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БАНКОРЕНБУРГ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкСаратов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ХакасскийМуниципальныйБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_КБАРЕСБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Автоградбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкАкцепт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ТойотаБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_КБЭНЕРГОТРАНСБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкВенец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкИТУРУП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_СИБСОЦБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_МирПривилегий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкИнтеза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_МОРСКОЙБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкРазвитиеСтолица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ТаврическийБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ПервыйИнвестиционныйБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_МОСКОМБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Газтрансбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Нацинвестпромбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкРЕСОКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_РУСНАРБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Кузнецкбизнесбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкКремлевский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_МеждународныйФинансовыйКлуб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Томскпромстройбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкАЛЕКСАНДРОВСКИЙ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_ДжейЭндТиБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Новобанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкПриморье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_СолидБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_РеалистБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_АКБДержава</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкНациональныйСтандарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_АКБЛантаБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_РНБАНК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_АИКБЕнисейскийОбъединенныйБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкБЖФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_КБДолинск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_Алтайкапиталбанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_БанкСИАБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБП_МТСБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСБП_Промсвязьбанк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ИнтеграцияСПлатежнымиСистемамиПовтИсп/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтеграцияСПлатежнымиСистемами".
// ОбщийМодуль.ИнтеграцияСПлатежнымиСистемамиПовтИсп.
//
// Повторно используемые серверные процедуры настройки интеграции с СБП.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Определяет доступность использования функциональности выполнения операций
// в платежной системе на основании прав доступа пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, оплата в платежной системе доступна.
//
Функция ИнтеграцияДоступна() Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиСлужебный.СлужебнаяИнтеграцияДоступна();
	
КонецФункции

// Определяет доступность использования функциональности подключения
// к СБП на основании прав доступа пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, оплата в платежной системе доступна.
//
Функция НастройкаИнтеграцияДоступна() Экспорт
	
	Возврат ИнтеграцияСПлатежнымиСистемамиСлужебный.СлужебнаяНастройкаИнтеграцияДоступна();
	
КонецФункции

// Создает структуру настроек подключения к сервису интеграции с платежными системами.
//
// Возвращаемое значение:
//  Структура - настройки подключения:
//   *НастройкиПроксиСервера - Структура - параметры прокси сервера.
//
Функция ИнициализироватьПараметрыПодключения() Экспорт
	
	ПараметрыОбмена = Новый Структура;
	ПараметрыОбмена.Вставить("НастройкиПроксиСервера", ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере());
	
	Возврат ПараметрыОбмена;
	
КонецФункции

// Определяет вид подключения платежной системы.
//
// Параметры:
//  ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСистемы - платежная система,
//                     для которой выполняется операция;
//
// Возвращаемое значение:
//  Булево - если Истина, если платежная система подключается через процессор третьей стороны.
//
Функция ПлатежнаяСистемаПодключаетсяЧерезTTP(ПлатежнаяСистема) Экспорт
	
	Возврат (ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Совкомбанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БАНКУРАЛСИБ
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Экспобанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_АбсолютБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкЛевобережный
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БланкБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_КБХлынов
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_ВЛАДБИЗНЕСБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_НОКССБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_ЗемскийБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_НСБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Форштадт
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_СКБПримсоцбанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_КБРостФинанс
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_ЭсБиАйБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_АКИБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_АлефБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_НИКОБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_КБАГРОПРОМКРЕДИТ
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БАНКОРЕНБУРГ
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкСаратов
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_ХакасскийМуниципальныйБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_КБАРЕСБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Автоградбанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкАкцепт
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_ТойотаБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_КБЭНЕРГОТРАНСБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкВенец
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкИТУРУП
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_СИБСОЦБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_МирПривилегий
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкИнтеза
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_МОРСКОЙБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкРазвитиеСтолица
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_ТаврическийБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_ПервыйИнвестиционныйБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_МОСКОМБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_КБДолинск
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Нацинвестпромбанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкРЕСОКредит
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_РУСНАРБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Кузнецкбизнесбанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкКремлевский
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_МеждународныйФинансовыйКлуб
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Томскпромстройбанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкАЛЕКСАНДРОВСКИЙ
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_ДжейЭндТиБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Новобанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкПриморье
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_СолидБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_РеалистБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_АКБДержава
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкНациональныйСтандарт
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_АКБЛантаБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_РНБАНК
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_АИКБЕнисейскийОбъединенныйБанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкБЖФ
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_КБДолинск
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_Алтайкапиталбанк
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_БанкСИАБ
		Или ПлатежнаяСистема = Перечисления.ПлатежныеСистемы.СБП_МТСБанк);
	
КонецФункции

#КонецОбласти
